#include "config.h"

#ifndef HAVE_ICONV_H
#include "codepage.h"

Codepage_t codepages[]= {
	{ 437,
	  "ΗόιβδΰεηκλθοξμΔΕ"
	  "ΙζΖτφςϋωÿΦάΆ£¥Pf"
	  "ανσϊρΡªΊΏr¬½Ό΅«»"
	  "_______________¬"
	  "________________"
	  "________________"
	  "abgpSsµtftodψΨ_N"
	  "=±<>||χ~°··Vn²__"
	},

	{ 819,
	  "________________"
	  "________________"
	  " ΅Ά£¤¥¦§¨©ª«¬­®―"
	  "°±²³΄µ¶·ΈΉΊ»Ό½ΎΏ"
	  "ΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟ"
	  "ΠΡÒΣΤΥΦΧΨΩΪΫάέήί"
	  "ΰαβγδεζηθικλμνξο"
	  "πρςστυφχψωϊϋόύώÿ"
	},

	{ 850,
	  "ΗόιβδΰεηκλθοξμΔΕ"
	  "ΙζΖτφςϋωÿΦάψ£ΨΧ_"
	  "ανσϊρΡªΊΏ®¬½Ό΅«»"
	  "_____ΑΒΐ©____Ά¥¬"
	  "______γΓ_______¤"
	  "πΠΙΛΘiΝΞΟ____|I_"
	  "ΣίΤÒυΥµώήΪΩύέή―΄"
	  "­±_Ύ¶§χΈ°¨·Ή³²__"
	},
	
	{ 852,
	  "ΗόιβδucηlλΥυξZΔC"
	  "ΙLlτφLlSsΦάTtLΧc"
	  "ανσϊAaZzEe zCs«»"
	  "_____ΑΒES____Zz¬"
	  "______Aa_______¤"
	  "πΠDΛdΡΝΞe_r__TU_"
	  "ΣίΤNnρSsRΪrUύέt΄"
	  "­~.~~§χΈ°¨·ΉuRr_"
	},
	
	{ 860,
	  "ΗόιβγΰεηκλθΝυμΓΒ"
	  "ΙΐΘτυςΪωΜΥάΆ£ΩPΣ"
	  "ανσϊρΡªΊΏÒ¬½Ό΅«»"
	  "_______________¬"
	  "________________"
	  "________________"
	  "abgpSsµtftodψΨ_N"
	  "=±<>||χ~°··Vn²__"
	},
	
	{ 863,
	  "ΗόιβΒΰ¶ηκλθοξ_ΐ§"
	  "ΙΘΚτΛΟϋω¤ΤάΆ£ΩΫf"
	  "|΄σϊ¨ ³―Ξr¬½ΌΎ«»"
	  "_______________¬"
	  "________________"
	  "________________"
	  "abgpSsµtftodψΨ_N"
	  "=±<>||χ~°··Vn²__"
	},
	
	{ 865,
	  "ΗόιβδΰεηκλθοξμΔΕ"
	  "ΙζΖτφςϋωÿΦάψ£ΨPf"
	  "ανσϊρΡªΊΏr¬½Ό΅«¤"
	  "_______________¬"
	  "________________"
	  "________________"
	  "abgpSsµtftodψΨ_N"
	  "=±<>||χ~°··Vn²__",
	},

	/* Taiwanese (Chinese Complex Character) support */
	{ 950,
	 "€‚ƒ„…†‡‰‹"
	 "‘’“”•–—™›"
	 " ΅Ά£¤¥¦§¨©ª«¬­®―"
	 "°±²³΄µ¶·ΈΉΊ»Ό½ΎΏ"
	 "ΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟ"
	 "ΠΡÒΣΤΥΦΧΨΩΪΫάέήί"
	 "ΰαβγδεζηθικλμνξο"
	 "πρςστυφχψωϊϋόύώÿ",
	},


	{ 0 }
};

#endif
